Revit 2024 API
ConduitSizeSettings.RemoveConduitStandardType Method
 Erases the existing ConduitSizes with this conduit standard name; the consuit standard type can not be removed if it is in use.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public bool RemoveConduitStandardType(
	Document pADoc,
	string standardName
)
Visual Basic
Public Function RemoveConduitStandardType ( _
	pADoc As Document, _
	standardName As String _
) As Boolean
Visual C++
public:
bool RemoveConduitStandardType(
	Document^ pADoc,
	String^ standardName
)
Parameters
pADoc
Type: Autodesk.Revit.DB.Document
 The document.
standardName
Type: System.String
 The conduit standard name.
Return Value
 True if removing success; otherwise false.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The conduit standard is already in use. -or- The conduit standard is the last one.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ConduitSizeSettings Class
Autodesk.Revit.DB.Electrical Namespace